- pandas is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool,built on top of the Python programming language.

### Practical data analysis with Python.

- Guide for the Below analysis:-http://wavedatalab.github.io/datawithpython/m

- Muging Data.
- Aggregating Data.
- Visualizing Data.
- Time Series.

### Start With An Examples.

In [19]:
import pandas as pd

In [20]:
df = pd.DataFrame( {'AAA' : [4,5,6,7], 'BBB' : [10,20,30,40],'CCC' : [100,50,-30,-50]})

In [21]:
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [22]:
df.loc[df['AAA']>=5]['BBB']

1    20
2    30
3    40
Name: BBB, dtype: int64

In [24]:
df.loc[df.AAA >= 5,'BBB']=-1  #here we had change the values of BBB Columns with -1 for those greater than and equal to 5.

In [25]:
df

   AAA  BBB  CCC
0    4   10  100
1    5   -1   50
2    6   -1  -30
3    7   -1  -50

- Similarly

In [32]:
df.loc[df['AAA']>=5][['BBB','CCC']]

   BBB  CCC
1   -1   50
2   -1  -30
3   -1  -50

In [29]:
df.loc[df['AAA']>=5,['BBB','CCC']]

   BBB  CCC
1   -1   50
2   -1  -30
3   -1  -50

In [33]:
df.loc[df['AAA']>=5,['BBB','CCC']]=555

In [34]:
df

   AAA  BBB  CCC
0    4   10  100
1    5  555  555
2    6  555  555
3    7  555  555

In [37]:
df.loc[df['AAA']<5,['BBB','CCC']]=800

In [39]:
df

   AAA  BBB  CCC
0    4  800  800
1    5  555  555
2    6  555  555
3    7  555  555

In [40]:
df_mask = pd.DataFrame({'AAA' : [True] * 4, 'BBB' : [False] * 4,'CCC' :[True,False] * 2})

In [41]:
df_mask

    AAA    BBB    CCC
0  True  False   True
1  True  False  False
2  True  False   True
3  True  False  False

In [42]:
df.where(df_mask,-1000)

   AAA   BBB   CCC
0    4 -1000   800
1    5 -1000 -1000
2    6 -1000   555
3    7 -1000 -1000

In [45]:
df = pd.DataFrame({'AAA' : [4,5,6,7], 'BBB' : [10,20,30,40],'CCC' : [100,50,-30,-50]});

In [46]:
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [53]:
## Numpy Np.where

In [47]:
import numpy as np

In [51]:
df['Logic']=np.where(df['AAA']>5,'High','Low')

In [52]:
df['Logic']

0     Low
1     Low
2    High
3    High
Name: Logic, dtype: object

In [54]:
df

   AAA  BBB  CCC Logic
0    4   10  100   Low
1    5   20   50   Low
2    6   30  -30  High
3    7   40  -50  High

In [55]:
#accodring to pandas where function

In [56]:
df.where(df['AAA']>4,100)

   AAA  BBB  CCC Logic
0  100  100  100   100
1    5   20   50   Low
2    6   30  -30  High
3    7   40  -50  High

In [60]:
df.where(df['AAA']>6,200)

   AAA  BBB  CCC Logic
0  200  200  200   200
1  200  200  200   200
2  200  200  200   200
3    7   40  -50  High

In [61]:
df = pd.DataFrame({'AAA' : [4,5,6,7], 'BBB' : [10,20,30,40],'CCC' : [100,50,-30,-50]})

In [62]:
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [64]:
dflow=df.loc[df['AAA']<=5]
dflow

   AAA  BBB  CCC
0    4   10  100
1    5   20   50

In [65]:
dfhigh=df.loc[df['AAA']>5]
dfhigh

   AAA  BBB  CCC
2    6   30  -30
3    7   40  -50

In [66]:
newseries = df.loc[(df['BBB'] < 25) & (df['CCC'] >= -40), 'AAA']

In [67]:
newseries

0    4
1    5
Name: AAA, dtype: int64

In [68]:
newseries = df.loc[(df['BBB'] > 25) | (df['CCC'] >= -40), 'AAA']

In [69]:
newseries

0    4
1    5
2    6
3    7
Name: AAA, dtype: int64

In [70]:
df.loc[(df['BBB'] > 25) | (df['CCC'] >= 75), 'AAA'] = 0.1

In [71]:
df

   AAA  BBB  CCC
0  0.1   10  100
1  5.0   20   50
2  0.1   30  -30
3  0.1   40  -50

In [73]:
df = pd.DataFrame({'AAA' : [4,5,6,7], 'BBB' : [10,20,30,40],'CCC' : [100,50,-30,-50]})

In [74]:
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [75]:
aValue = 43.0

In [76]:
df.loc[(df.CCC-aValue).abs().argsort()]

   AAA  BBB  CCC
1    5   20   50
0    4   10  100
2    6   30  -30
3    7   40  -50

In [77]:
df = pd.DataFrame({'AAA' : [4,5,6,7], 'BBB' : [10,20,30,40],'CCC' : [100,50,-30,-50]})

In [78]:
Crit1 = df['AAA'] <= 5.5
Crit2 = df['BBB'] == 10.0
Crit3 = df['CCC'] > -40.0

In [79]:
AllCrit = Crit1 & Crit2 & Crit3

In [80]:
AllCrit

0     True
1    False
2    False
3    False
dtype: bool

In [82]:
CritList = [Crit1,Crit2,Crit3]

In [84]:
import functools

In [85]:
AllCrit = functools.reduce(lambda x,y: x & y, CritList)

In [86]:
AllCrit

0     True
1    False
2    False
3    False
dtype: bool

In [88]:
df = pd.DataFrame( {'AAA' : [4,5,6,7], 'BBB' : [10,20,30,40],'CCC' : [100,50,-30,-50]})

In [89]:
df[(df.AAA <= 6) & (df.index.isin([0,2,4]))]

   AAA  BBB  CCC
0    4   10  100
2    6   30  -30

In [90]:
data = {'AAA' : [4,5,6,7], 'BBB' : [10,20,30,40],'CCC' : [100,50,-30,-50]}
df = pd.DataFrame(data=data,index=['foo','bar','boo','kar'])

In [91]:
df.head()

     AAA  BBB  CCC
foo    4   10  100
bar    5   20   50
boo    6   30  -30
kar    7   40  -50

In [92]:
df.loc['bar':'kar'] #Label

     AAA  BBB  CCC
bar    5   20   50
boo    6   30  -30
kar    7   40  -50

In [93]:
df.iloc[0:3]

     AAA  BBB  CCC
foo    4   10  100
bar    5   20   50
boo    6   30  -30

In [94]:
df.loc['bar':'kar']

     AAA  BBB  CCC
bar    5   20   50
boo    6   30  -30
kar    7   40  -50

In [95]:
df2 = pd.DataFrame(data=data,index=[1,2,3,4]); #Note index starts at 1.

In [96]:
df2

   AAA  BBB  CCC
1    4   10  100
2    5   20   50
3    6   30  -30
4    7   40  -50

In [97]:
df2.iloc[1:3] #Position-oriented

   AAA  BBB  CCC
2    5   20   50
3    6   30  -30

In [98]:
df2.loc[1:3] #Label-oriented

   AAA  BBB  CCC
1    4   10  100
2    5   20   50
3    6   30  -30

In [99]:
 df = pd.DataFrame({'AAA' : [4,5,6,7], 'BBB' : [10,20,30,40], 'CCC' : [100,50,-30,-50]});

In [100]:
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

- Using inverse operator (~) to take the complement of a mask

In [101]:
df[~((df.AAA <= 6) & (df.index.isin([0,2,4])))]

   AAA  BBB  CCC
1    5   20   50
3    7   40  -50

In [104]:
df = pd.DataFrame({'AAA' : [1,1,1,2,2,2,3,3], 'BBB' : [2,1,3,4,5,1,2,3]})

In [105]:
df

   AAA  BBB
0    1    2
1    1    1
2    1    3
3    2    4
4    2    5
5    2    1
6    3    2
7    3    3

-  Method 1 : idxmin() to get the index of the mins

In [106]:
df.loc[df.groupby("AAA")["BBB"].idxmin()]

   AAA  BBB
1    1    1
5    2    1
6    3    2

- Method 2 : sort then take first of each

In [107]:
df.sort_values(by="BBB").groupby("AAA", as_index=False).first()

   AAA  BBB
0    1    1
1    2    1
2    3    2

## Value_counts

In [109]:
df = pd.DataFrame({'Color': 'Red Red Red Blue'.split(),'Value': [100, 150, 50, 50]});

In [110]:
df

  Color  Value
0   Red    100
1   Red    150
2   Red     50
3  Blue     50

In [111]:
df['Counts'] = df.groupby(['Color']).transform(len)

In [112]:
df

  Color  Value  Counts
0   Red    100       3
1   Red    150       3
2   Red     50       3
3  Blue     50       1

In [113]:
df = pd.DataFrame({u'line_race': [10, 10, 8, 10, 10, 8],u'beyer': [99, 102, 103, 103, 88, 100]},index=[u'Last Gunfighter', u'Last Gunfighter', u'Last Gunfighter',u'Paynter', u'Paynter', u'Paynter']);

In [114]:
df

                 line_race  beyer
Last Gunfighter         10     99
Last Gunfighter         10    102
Last Gunfighter          8    103
Paynter                 10    103
Paynter                 10     88
Paynter                  8    100

In [115]:
df['beyer_shifted'] = df.groupby(level=0)['beyer'].shift(1)

In [116]:
df

                 line_race  beyer  beyer_shifted
Last Gunfighter         10     99            NaN
Last Gunfighter         10    102           99.0
Last Gunfighter          8    103          102.0
Paynter                 10    103            NaN
Paynter                 10     88          103.0
Paynter                  8    100           88.0

## Pivot.

In [117]:
df = pd.DataFrame(data={'Province' : ['ON','QC','BC','AL','AL','MN','ON'],
                            'City' : ['Toronto','Montreal','Vancouver','Calgary','Edmonton','Winnipeg','Windsor'],
                            'Sales' : [13,6,16,8,4,3,1]})

In [118]:
df

  Province       City  Sales
0       ON    Toronto     13
1       QC   Montreal      6
2       BC  Vancouver     16
3       AL    Calgary      8
4       AL   Edmonton      4
5       MN   Winnipeg      3
6       ON    Windsor      1

In [119]:
table = pd.pivot_table(df,values=['Sales'],index=['Province'],columns=['City'],aggfunc=np.sum,margins=True)

In [122]:
table.stack('City')

                    Sales
Province City
AL       All         12.0
         Calgary      8.0
         Edmonton     4.0
BC       All         16.0
         Vancouver   16.0
MN       All          3.0
         Winnipeg     3.0
ON       All         14.0
         Toronto     13.0
         Windsor      1.0
QC       All          6.0
         Montreal     6.0
All      All         51.0
         Calgary      8.0
         Edmonton     4.0
         Montreal     6.0
         Toronto     13.0
         Vancouver   16.0
         Windsor      1.0
         Winnipeg     3.0

In [123]:
grades = [48,99,75,80,42,80,72,68,36,78]

In [124]:
df = pd.DataFrame( {'ID': ["x%d" % r for r in range(10)],'Gender' : ['F', 'M', 'F', 'M', 'F', 'M', 'F', 'M', 'M', 'M'],
                       'ExamYear': ['2007','2007','2007','2008','2008','2008','2008','2009','2009','2009'],
                       'Class': ['algebra', 'stats', 'bio', 'algebra', 'algebra', 'stats', 'stats', 'algebra', 'bio', 'bio'],
                      'Participated': ['yes','yes','yes','yes','no','yes','yes','yes','yes','yes'],
                       'Passed': ['yes' if x > 50 else 'no' for x in grades],
                        'Employed': [True,True,True,False,False,False,False,True,True,False],
                    'Grade': grades})

In [125]:
df

   ID Gender ExamYear    Class Participated Passed  Employed  Grade
0  x0      F     2007  algebra          yes     no      True     48
1  x1      M     2007    stats          yes    yes      True     99
2  x2      F     2007      bio          yes    yes      True     75
3  x3      M     2008  algebra          yes    yes     False     80
4  x4      F     2008  algebra           no     no     False     42
5  x5      M     2008    stats          yes    yes     False     80
6  x6      F     2008    stats          yes    yes     False     72
7  x7      M     2009  algebra          yes    yes      True     68
8  x8      M     2009      bio          yes     no      True     36
9  x9      M     2009      bio          yes    yes     False     78

In [126]:
df.groupby('ExamYear').agg({'Participated': lambda x: x.value_counts()['yes'],
                    'Passed': lambda x: sum(x == 'yes'),
                    'Employed' : lambda x : sum(x),
                    'Grade' : lambda x : sum(x) / len(x)})

          Participated  Passed  Employed      Grade
ExamYear
2007                 3       2         3  74.000000
2008                 3       3         0  68.500000
2009                 3       2         2  60.666667

In [127]:
df = pd.DataFrame(data=np.random.randn(2000,2)/10000,
                   index=pd.date_range('2001-01-01',periods=2000),
                    columns=['A','B'])

In [128]:
df

                       A         B
2001-01-01  1.368159e-05 -0.000019
2001-01-02 -7.909576e-07 -0.000081
2001-01-03  1.124917e-04 -0.000047
2001-01-04 -7.080283e-05  0.000105
2001-01-05  2.836023e-04 -0.000061
...                  ...       ...
2006-06-19 -6.251917e-05 -0.000044
2006-06-20 -1.625497e-04  0.000243
2006-06-21  6.223008e-05 -0.000087
2006-06-22  3.410254e-05  0.000029
2006-06-23  2.411674e-04 -0.000097

[2000 rows x 2 columns]

## Time Series

In [129]:
dates = pd.date_range('2000-01-01', periods=5)
dates.to_period(freq='M').to_timestamp()

DatetimeIndex(['2000-01-01', '2000-01-01', '2000-01-01', '2000-01-01',
               '2000-01-01'],
              dtype='datetime64[ns]', freq=None)